IRP/src/Catalogs/ItemSegments/ItemSegments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemSegments</name>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/ItemSegments/ItemSegments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>ItemSegments</name>
 <dimensions>
  <name>Segment</name>
  <type>
   <types>CatalogRef.ItemSegments</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/ItemSegments/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Object.Ref.IsEmpty() Then
		Items.GroupContent.Visible = False;
	Else
		SegmentParameter = ContentSegment.Parameters.Items.Find("Segment");
		SegmentParameter.Value = Object.Ref;
		SegmentParameter.Use = True;
	EndIf;
	
	AddAttributesAndPropertiesServer.OnCreateAtServer(ThisObject);
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	ExtensionServer.AddAttributesFromExtensions(ThisObject, Object.Ref);
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source, AddInfo = Undefined) Export
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
EndProcedure

#EndRegion

#Region AddAttributes

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject);
EndProcedure

&AtClient
Procedure AddAttributeButtonClick(Item) Export
	AddAttributesAndPropertiesClient.AddAttributeButtonClick(ThisObject, Item);
EndProcedure

#EndRegion

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

&AtClient
Procedure Check(Command)
	CheckAtServer(Object.Ref);
	Items.ContentSegment.Refresh();
EndProcedure

&AtServerNoContext
Procedure CheckAtServer(Segment)
	Catalogs.ItemSegments.CheckContent(Segment);
EndProcedure

&AtClient
Procedure ContentSegmentBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
	
	FillingValues = New Structure;
	FillingValues.Insert("Segment", Object.Ref);
	If Clone And Items.ContentSegment.CurrentData <> Undefined Then
		FillingValues.Insert("Item", Items.ContentSegment.CurrentData.Item);
		FillingValues.Insert("ItemKey", Items.ContentSegment.CurrentData.ItemKey);
	EndIf;
	FormParameters = New Structure("FillingValues", FillingValues);
	
	OpenForm("InformationRegister.ItemSegments.RecordForm", FormParameters,,,,, 
		New NotifyDescription("AddRowFinish", ThisObject));
EndProcedure

&AtClient
Procedure AddRowFinish(Result, AddInfo) Export
	Items.ContentSegment.Refresh();
EndProcedure
